deducoes = {

    # Distrito de Angra do Heroísmo
    '1901' : "",
    '1902' : 0.003,
    '1903' : 0.003,
    '1904' : 0.003,
    '1905' : 0.003,

    # Distrito de Aveiro
    '0101' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0102' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0103' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0104' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0105' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0106' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0108' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0110' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0111' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0112' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0113' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0114' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0115' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0116' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0109' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0117' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0118' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0119' : {"1": 30, "2": 70, "3 ou mais": 140},

    # Distrito de Beja
    '0201' : {"1": 0, "2": 0, "3 ou mais": 0},
    '0202' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0203' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0204' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0205' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0206' : {"1": 0, "2": 0, "3 ou mais": 0},
    '0207' : {"1": 0, "2": 0, "3 ou mais": 0},
    '0208' : {"1": 0, "2": 0, "3 ou mais": 140},
    '0209' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0210' : {"1": 0, "2": 0, "3 ou mais": 0},
    '0211' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0212' : {"1": 30, "2": 70, "3 ou mais": 140},
    '0213' : {"1": 0, "2": 0, "3 ou mais": 0},
    '0214' : {"1": 0, "2": 0, "3 ou mais": 0},

    # Distrito de Braga
    '0301' : 0.003,
    '0302' : 0.0033, # Barcelos; desceu em 2023
    '0303' : 0.0033,
    '0304' : 0.003,
    '0305' : 0.003,
    '0306' : 0.003,
    '0307' : 0.003,
    '0308' : 0.0032, # Guimarães; desceu em 2024
    '0309' : 0.003,
    '0310' : 0.003,
    '0311' : 0.003,
    '0312' : 0.00335, # VN Famalicão; desceu em 2023 e 2025
    '0313' : 0.003,
    '0314' : 0.0035, # Vizela; desceu em 2025

    # Distrito de Bragança
    '0401' : 0.0038, # Alfândega da Fé; desceu em 2023
    '0402' : 0.003,
    '0403' : 0.003,
    '0404' : 0.003,
    '0405' : 0.003,
    '0406' : 0.003,
    '0407' : 0.003,
    '0408' : 0.003,
    '0409' : 0.0045, # Torre de Moncorvo; subiu em 2025
    '0410' : 0.003,
    '0411' : 0.003,
    '0412' : 0.003,

    # Distrito de Castelo Branco
    '0501' : 0.003, # Belmonte; desceu em 2023
    '0502' : 0.003,
    '0503' : 0.003, # Covilhã; desceu em 2023
    '0504' : 0.0038,
    '0505' : 0.003,
    '0506' : 0.003,
    '0507' : 0.003,
    '0508' : 0.003,
    '0509' : 0.003,
    '0510' : 0.003,
    '0511' : 0.003,

    # Distrito de Coimbra
    '0601' : 0.003,
    '0602' : 0.0038,
    '0603' : 0.003,
    '0604' : 0.003,
    '0605' : 0.004,
    '0606' : 0.0033,
    '0607' : 0.0039, # Lousã; desceu em 2024
    '0608' : 0.003,
    '0609' : 0.003,
    '0610' : 0.0034,
    '0611' : 0.0032, # Oliveira do Hospital; desceu em 2025
    '0612' : 0.003,
    '0613' : 0.003,
    '0614' : 0.00375,
    '0615' : 0.0034,
    '0616' : 0.0035, # Tábua; subiu em 2023
    '0617' : 0.0039, # VN Poiares; desceu em 2025

    # Distrito de Évora
    '0701' : 0.0045,
    '0702' : 0.003,
    '0703' : 0.0035, # Borba; desceu em 2023, 2024 e 2025
    '0704' : 0.003,
    '0705' : 0.0039, # Évora; desceu em 2023 e 2024; subiu em 2025
    '0706' : 0.003,
    '0707' : 0.003,
    '0708' : 0.00325, # Mourão; desceu em 2025
    '0709' : 0.003,
    '0710' : 0.003,
    '0711' : 0.0035,
    '0712' : 0.0033, # Vendas Novas; desceu em 2023
    '0713' : 0.003,
    '0714' : 0.003, # Vila Viçosa; desceu em 2024

    # Distrito de Faro
    '0801' : 0.003,
    '0802' : 0.003,
    '0803' : 0.003,
    '0804' : 0.0039, # Castro Marim; desceu em 2025
    '0805' : 0.003, # Faro; desceu em 2024 e 2025
    '0806' : 0.0036,
    '0807' : 0.003, # Lagos; desceu em 2023
    '0808' : 0.003,
    '0809' : 0.003,
    '0810' : 0.0037, # Olhão; desceu em 2024
    '0811' : 0.0038, # Portimão; desceu em 2023, 2024 e 2025
    '0812' : 0.0041,
    '0813' : 0.003,
    '0814' : 0.003, # Tavira; desceu em 2023 e 2024
    '0815' : 0.003,
    '0816' : 0.0045, # Vila Real de Sto. António; desceu em 2025

    # Distrito do Funchal
    '2201' : 0.003,
    '2202' : 0.003, # Câmara de Lobos; desceu em 2024
    '2203' : 0.003,
    '2204' : 0.003,
    '2205' : 0.003,
    '2206' : 0.003,
    '2207' : 0.003,
    '2208' : 0.003,
    '2211' : 0.003,
    '2209' : 0.003,
    '2210' : 0.003,

    # Distrito da Guarda
    '0901' : 0.003,
    '0902' : 0.003,
    '0903' : 0.0035, # Celorico da Beira; desceu em 2025
    '0904' : 0.003,
    '0905' : 0.0041, # Fornos de Algodres; desceu em 2023 e 2025
    '0906' : 0.0036,
    '0907' : 0.00375,
    '0908' : 0.003, # Em 2025 não aparece no Portal das Finanças!
    '0909' : 0.003,
    '0910' : 0.003,
    '0911' : 0.003,
    '0912' : 0.0034, # Seia; desceu em 2023, 2024 e 2025
    '0913' : 0.003,
    '0914' : 0.003,

    # Distrito da Horta
    '2001' : 0.003, # Em 2025 não aparece no Portal das Finanças!
    '2002' : 0.003,
    '2003' : 0.003,
    '2004' : 0.003, # Em 2025 não aparece no Portal das Finanças!
    '2005' : 0.003, # Em 2025 não aparece no Portal das Finanças!
    '2007' : 0.003,
    '2006' : 0.003,

    # Distrito de Leiria
    '1001' : 0.003,
    '1002' : 0.003,
    '1003' : 0.003,
    '1004' : 0.003,
    '1005' : 0.003,
    '1006' : 0.003,
    '1007' : 0.003, # Castanheira de Pêra; desceu em 2024
    '1008' : 0.003,
    '1009' : 0.003,
    '1010' : 0.003,
    '1011' : 0.0045,
    '1012' : 0.0036,
    '1013' : 0.003,
    '1014' : 0.00305, # Peniche; desceu em 2023 e 2024
    '1015' : 0.003,
    '1016' : 0.003,

    # Distrito de Lisboa
    '1101' : 0.0037, # Alenquer; desceu em 2024
    '1115' : 0.003,
    '1102' : 0.00365, # Arruda dos Vinhos; desceu em 2024 e 2025
    '1103' : 0.0035,
    '1104' : 0.0035, # Cadaval; desceu em 2024 e 2025
    '1105' : 0.0033, # Cascais; desceu em 2025
    '1106' : 0.003,
    '1107' : 0.00362, # Loures; desceu em 2023, 2024 e 2025
    '1108' : 0.0035,
    '1109' : 0.0045,
    '1116' : 0.0034, # Odivelas; desceu em 2023 e 2025
    '1110' : 0.003,
    '1111' : 0.003,
    '1112' : 0.0036, # Sobral de Monte Agraço; desceu em 2023, 2024 e 2025
    '1113' : 0.0035,
    '1114' : 0.003,

    # Distrito de Ponta Delgada
    '2101' : 0.003,
    '2102' : 0.00425, # Nordeste; desceu em 2023
    '2103' : 0.003,
    '2104' : 0.003,
    '2105' : 0.003,
    '2107' : 0.003,
    '2106' : 0.00425, # Vila Franca do Campo; desceu em 2023

    # Distrito de Portalegre
    '1201' : 0.003,
    '1202' : 0.003,
    '1203' : 0.003,
    '1204' : 0.003,
    '1205' : 0.003,
    '1206' : 0.003,
    '1207' : 0.0035, # Elvas; desceu em 2025
    '1208' : 0.003,
    '1209' : 0.003,
    '1210' : 0.003,
    '1211' : 0.0035,
    '1212' : 0.003,
    '1213' : 0.003,
    '1214' : 0.003, # Portalegre; desceu em 2023, 2024 e 2025
    '1215' : 0.0036, # Sousel; desceu em 2024 e 2025

    # Distrito do Porto
    '1301' : 0.003,
    '1302' : 0.003,
    '1303' : 0.003,
    '1305' : 0.003,
    '1306' : 0.0035, # Maia; desceu em 2023, 2024 e 2025
    '1307' : 0.003,
    '1308' : 0.0037, # Matosinhos; subiu em 2023 e 2025
    '1309' : 0.003,
    '1310' : 0.003,
    '1311' : 0.003,
    '1312' : 0.00324,
    '1313' : 0.003,
    '1314' : 0.003, # Santo Tirso; desceu em 2024
    '1318' : 0.0039, # Trofa; desceu em 2023, 2024 e 2025
    '1315' : 0.0035, # Valongo; desceu em 2023, 2024 e 2025
    '1316' : 0.003,
    '1317' : 0.0036, # Vila Nova de Gaia; desceu em 2024 e 2025

    # Distrito de Santarém
    '1401' : 0.004,
    '1402' : 0.00375, # Alcanena; desceu em 2023, 2024 e 2025
    '1403' : 0.00375, # Almeirim; desceu em 2024
    '1404' : 0.0037, # Alpiarça; desceu em 2024 e 2025
    '1405' : 0.003, # Benavente; desceu em 2023
    '1406' : 0.0045,
    '1407' : 0.003,
    '1408' : 0.003, # Constância; desceu em 2023
    '1409' : 0.003, # Coruche; descem em 2024 e 2025
    '1410' : 0.003, # Entroncamento; desceu em 2024
    '1411' : 0.003,
    '1412' : 0.0034, # Golegã; desceu em 2025
    '1413' : 0.003,
    '1421' : 0.0031,
    '1414' : 0.0038,
    '1415' : 0.0035,
    '1416' : 0.00368, # Santarém; desceu em 2023, 2024 e 2025
    '1417' : 0.00325,
    '1418' : 0.0034, # Tomar; desceu em 2023
    '1419' : 0.0036, # Torres Novas; desceu em 2024
    '1420' : 0.0032,

    # Distrito de Setúbal
    '1501' : 0.003,
    '1502' : 0.0034, # Alcochete; desceu em 2023, 2024 e 2025
    '1503' : 0.0035, # Almada; desceu em 2023; Em 2025 não aparece no Portal das Finanças!
    '1504' : 0.0035, # Barreiro; desceu em 2024
    '1505' : 0.003, # Grândola; desceu em 2023 e 2024
    '1506' : 0.00365, # Moita; desceu em 2024
    '1507' : 0.0032, # Montijo; desceu em 2023, 2024 e 2025
    '1508' : 0.003, # Palmela; desceu em 2023, 2024 e 2025
    '1509' : 0.0031, # Santiago do Cacém; desceu em 2023, 2024 e 2025
    '1510' : 0.0033, # Seixal; desceu em 2023, 2024 e 2025
    '1511' : 0.004,
    '1512' : 0.0037, # Setúbal; desceu em 2024
    '1513' : 0.0034,

    # Distrito de Viana do Castelo
    '1601' : 0.0034,
    '1602' : 0.004, # Caminha; desceu em 2024 e 2025
    '1603' : 0.0032,
    '1604' : 0.003,
    '1605' : 0.003,
    '1606' : 0.0034,
    '1607' : 0.0032,
    '1608' : 0.003,
    '1609' : 0.0035, # Viana do Castelo; desceu em 2023
    '1610' : 0.003,

    # Distrito de Vila Real
    '1701' : 0.0033, # Alijó; desceu em 2023 e 2025
    '1702' : 0.003,
    '1703' : 0.003,
    '1704' : 0.004,
    '1705' : 0.003,
    '1706' : 0.003,
    '1707' : 0.003,
    '1708' : 0.0037, # Peso da Régua; desceu em 2023
    '1709' : 0.003,
    '1710' : 0.003,
    '1711' : 0.003,
    '1712' : 0.003,
    '1713' : 0.003,
    '1714' : 0.00385, # Vila Real; desceu em 2024

    # Distrito de Viseu
    '1801' : 0.003,
    '1802' : 0.003,
    '1803' : 0.003,
    '1804' : 0.003,
    '1805' : 0.00365,
    '1806' : 0.003, # Mangualde; desceu em 2024
    '1807' : 0.003,
    '1808' : 0.003,
    '1809' : 0.003,
    '1810' : 0.003,
    '1811' : 0.003,
    '1812' : 0.003,
    '1813' : 0.00375, # Resende; desceu em 2023
    '1815' : 0.003,
    '1816' : 0.003,
    '1814' : 0.0039,
    '1817' : 0.003,
    '1818' : 0.003,
    '1819' : 0.004,
    '1820' : 0.003,
    '1821' : 0.003,
    '1822' : 0.003, # Em 2025 não aparece no Portal das Finanças!
    '1823' : 0.003,
    '1824' : 0.003
    }


# Em 2025, não havia detalhe de Gondomar no Portal das Finanças!
gondomar = {
    '130401' : 0.00343,    # Covelo; desceu em 2024
    '130402' : 0.0039,     # Fânzeres; desceu em 2024
    '130403' : 0.00343,    # Foz do Sousa; desceu em 2024
    '130404' : 0.0039,     # Jovim; desceu em 2024
    '130405' : 0.00343,    # Lomba; desceu em 2024
    '130406' : 0.00343,    # Medas; desceu em 2024
    '130407' : 0.00343,    # Melres; desceu em 2024
    '130408' : 0.0039,     # Rio Tinto; desceu em 2024
    '130409' : 0.0039,     # São Cosme; desceu em 2024
    '130410' : 0.0039,     # São Pedro da Cova; desceu em 2024
    '130411' : 0.0039,     # Valbom; desceu em 2024
    '130412' : 0.0039,     # Baguim do Monte; desceu em 2024
    '130413' : 0.0041,     # U.F. Fânzeres e São Pedro da Cova
    '130414' : 0.00361,    # U.F. Foz do Sousa e Covelo
    '130415' : 0.0041,     # U.F. Gondomar (São Cosme), Valbom e Jovim
    '130416' : 0.00361     # U.F Melres e Medas
}

# Em 2025, não havia detalhe de Espinho no Portal das Finanças!
espinho = {
    '010701' : 0.0038,     # Anta (extinta)
    '010702' : 0.0038,     # Espinho
    '010702' : 0.0038,     # Guetim (extinta)
    '010704' : 0.0035,     # Paramos
    '010705' : 0.0038,     # Silvalde
    '010706' : 0.0038      # Anta e Guetim

}
